app/Controllers/dosenController.php

SELECT *
FROM `jurusan`
SELECT `mata_kuliah`.`kode_mk`, `mata_kuliah`.`nama_mk`, `mata_kuliah`.`id_jurusan`
FROM `mata_kuliah`
JOIN `jurusan` ON `jurusan`.`id` = `mata_kuliah`.`id_jurusan`
---
  public function unggah_rps()
  {
    // Get data for dropdowns
    $data['prodi'] = $this->jurusan->findAll(); // Get full jurusan data
    $data['tahun_ajaran'] = $this->getTahunAjaran();
    $data['rps'] = $this->getRpsData();

    // Get mata kuliah data grouped by jurusan and convert to array
    $mataKuliahQuery = $this->db->table('mata_kuliah')
      ->select('mata_kuliah.kode_mk, mata_kuliah.nama_mk, mata_kuliah.id_jurusan')
      ->join('jurusan', 'jurusan.id = mata_kuliah.id_jurusan')
      ->get();

    $data['mata_kuliah'] = $mataKuliahQuery ? $mataKuliahQuery->getResultArray() : [];

SELECT *
FROM `jurusan`
SELECT `mata_kuliah`.*, `jurusan`.`nama_jurusan`
FROM `mata_kuliah`
JOIN `jurusan` ON `jurusan`.`id` = `mata_kuliah`.`id_jurusan`
SELECT `daftar_rps`.*, `mata_kuliah`.`nama_mk`, `jurusan`.`nama_jurusan`
FROM `daftar_rps`
JOIN `mata_kuliah` ON `mata_kuliah`.`kode_mk` = `daftar_rps`.`kode_mk`
JOIN `jurusan` ON `jurusan`.`id` = `daftar_rps`.`jurusan_id`
WHERE `daftar_rps`.`user_id` = '7'
---
  public function daftar_upload()
  {
    // Get current user ID
    $userId = user_id();

    // Get data for dropdowns
    $data['prodi'] = $this->jurusan->findAll();
    $data['mata_kuliah'] = $this->db->table('mata_kuliah')
      ->select('mata_kuliah.*, jurusan.nama_jurusan')
      ->join('jurusan', 'jurusan.id = mata_kuliah.id_jurusan')
      ->get()->getResult();

    // Get RPS list for current user only
    $data['rps_list'] = $this->db->table('daftar_rps')
      ->select('daftar_rps.*, mata_kuliah.nama_mk, jurusan.nama_jurusan')
      ->join('mata_kuliah', 'mata_kuliah.kode_mk = daftar_rps.kode_mk')
      ->join('jurusan', 'jurusan.id = daftar_rps.jurusan_id')
      ->where('daftar_rps.user_id', $userId)
      ->get()->getResult();

SELECT `mata_kuliah`.`kode_mk`, `mata_kuliah`.`nama_mk`
FROM `mata_kuliah`
---
  public function bap()
  {

    $userId = user_id();

    $mataKuliahQuery = $this->db->table('mata_kuliah')
      ->select('mata_kuliah.kode_mk, mata_kuliah.nama_mk')
      ->get();

SELECT `bap`.*, `mata_kuliah`.`nama_mk`, `bap`.`id` as `bap_id`
FROM `bap`
JOIN `mata_kuliah` ON `mata_kuliah`.`kode_mk` = `bap`.`kode_mk`
WHERE `bap`.`user_id` = '7'
ORDER BY `bap`.`tanggal` DESC
SELECT *
FROM `bap_catatan`
WHERE `bap_id` = '3'
ORDER BY `urutan` ASC
---
  public function daftar_bap()
  {
    $userId = user_id();

    $query = $this->db->table('bap')
      ->select('bap.*, mata_kuliah.nama_mk, bap.id as bap_id')
      ->join('mata_kuliah', 'mata_kuliah.kode_mk = bap.kode_mk')
      ->where('bap.user_id', $userId)
      ->orderBy('bap.tanggal', 'DESC');

    $data['bap_list'] = $query->get()->getResultArray();

    if (!empty($data['bap_list'])) {
      foreach ($data['bap_list'] as &$bap) {
        $bap['catatan'] = $this->db->table('bap_catatan')
          ->where('bap_id', $bap['bap_id'])
          ->orderBy('urutan', 'ASC')
          ->get()
          ->getResultArray();

SELECT `daftar_rps`.*, `mata_kuliah`.`nama_mk`, `jurusan`.`nama_jurusan`
FROM `daftar_rps`
JOIN `mata_kuliah` ON `mata_kuliah`.`kode_mk` = `daftar_rps`.`kode_mk`
JOIN `jurusan` ON `jurusan`.`id` = `daftar_rps`.`jurusan_id`
WHERE `daftar_rps`.`user_id` = '7'
SELECT *
FROM `unsur_rps`
SELECT *
FROM `review_rps`
WHERE `daftar_rps_id` = '14'
---
  public function feedback()
  {
    // Ambil ID dosen yang sedang login
    $dosenId = user_id();

    // Ambil daftar RPS dengan informasi lengkap
    $data['daftar_rps'] = $this->db->table('daftar_rps')
      ->select('daftar_rps.*, mata_kuliah.nama_mk, jurusan.nama_jurusan')
      ->join('mata_kuliah', 'mata_kuliah.kode_mk = daftar_rps.kode_mk')
      ->join('jurusan', 'jurusan.id = daftar_rps.jurusan_id')
      ->where('daftar_rps.user_id', $dosenId)
      ->get()
      ->getResult();

    // Ambil ID RPS yang dipilih dari query parameter
    $selectedRpsId = $this->request->getGet('rps_id');

    if ($selectedRpsId) {
      // Ambil semua unsur RPS
      $data['unsur_rps'] = $this->unsurModel->findAll();

      // Gunakan ReviewRpsModel untuk mengambil review dengan catatan
      $reviewModel = new \App\Models\ReviewRpsModel();
      $reviews = $reviewModel->where('daftar_rps_id', $selectedRpsId)->findAll();