app/Controllers/dosenController.php

  public function daftar_upload()
  {
    // Get current user ID
    $userId = user_id();

    // Get search parameters
    $searchMataKuliah = $this->request->getGet('mata_kuliah');
    $searchProdi = $this->request->getGet('prodi');

    // Get data for dropdowns
    $data['prodi'] = $this->jurusan->findAll();
    $data['mata_kuliah'] = $this->db->table('mata_kuliah')
      ->select('mata_kuliah.*, jurusan.nama_jurusan')
      ->join('jurusan', 'jurusan.id = mata_kuliah.id_jurusan')
      ->get()->getResult();

    // Build base query for RPS list
    $query = $this->db->table('daftar_rps')
      ->select('daftar_rps.*, mata_kuliah.nama_mk, jurusan.nama_jurusan')
      ->join('mata_kuliah', 'mata_kuliah.kode_mk = daftar_rps.kode_mk')
      ->join('jurusan', 'jurusan.id = daftar_rps.jurusan_id')
      ->where('daftar_rps.user_id', $userId);
---
SELECT `daftar_rps`.*, `mata_kuliah`.`nama_mk`, `jurusan`.`nama_jurusan`
FROM `daftar_rps`
JOIN `mata_kuliah` ON `mata_kuliah`.`kode_mk` = `daftar_rps`.`kode_mk`
JOIN `jurusan` ON `jurusan`.`id` = `daftar_rps`.`jurusan_id`
WHERE `daftar_rps`.`user_id` = '7'

  public function daftar_bap()
  {
    $userId = user_id();

    $query = $this->db->table('bap')
      ->select('bap.*, mata_kuliah.nama_mk, bap.id as bap_id')
      ->join('mata_kuliah', 'mata_kuliah.kode_mk = bap.kode_mk')
      ->where('bap.user_id', $userId)
      ->orderBy('bap.tanggal', 'DESC');

    $data['bap_list'] = $query->get()->getResultArray();

    if (!empty($data['bap_list'])) {
      foreach ($data['bap_list'] as &$bap) {
        $bap['catatan'] = $this->db->table('bap_catatan')
          ->where('bap_id', $bap['bap_id'])
          ->orderBy('urutan', 'ASC')
          ->get()
          ->getResultArray();
---
SELECT `bap`.*, `mata_kuliah`.`nama_mk`, `bap`.`id` as `bap_id`
FROM `bap`
JOIN `mata_kuliah` ON `mata_kuliah`.`kode_mk` = `bap`.`kode_mk`
WHERE `bap`.`user_id` = '7'
ORDER BY `bap`.`tanggal` DESC
SELECT *
FROM `bap_catatan`
WHERE `bap_id` = '3'
ORDER BY `urutan` ASC