app/Controllers/GpmController.php

SELECT *
FROM `daftar_rps`
SELECT *
FROM `mata_kuliah`
---
  public function gpm_rps()
  {
    $data['daftarrps'] = $this->daftarRpsModel->findAll();
    $data['mata_kuliah'] = $this->mataKuliahModel->findAll();

SELECT *
FROM `mata_kuliah`
SELECT `bap`.*, `mata_kuliah`.`nama_mk`
FROM `bap`
JOIN `mata_kuliah` ON `mata_kuliah`.`kode_mk` = `bap`.`kode_mk`
SELECT *
FROM `bap_catatan`
WHERE `bap_id` = '3'
---
  public function bap()
  {
    $data['mata_kuliah'] = $this->mataKuliahModel->findAll();

    // Tambahkan query untuk mendapatkan data lengkap
    $query = $this->db->table('bap')
      ->select('bap.*, mata_kuliah.nama_mk')
      ->join('mata_kuliah', 'mata_kuliah.kode_mk = bap.kode_mk')
      ->get();

    $data['bap_list'] = $query->getResultArray();

    // Ambil catatan review untuk setiap BAP
    if (!empty($data['bap_list'])) {
      foreach ($data['bap_list'] as &$bap) {
        $bap['catatan'] = $this->bapCatatanModel
          ->where('bap_id', $bap['id'])
          ->findAll();